DoS Testmessages/Metro-Enc_originalMessage.xml

<soapenv:Envelope xmlns:met="http://metro1.kmzs.ba/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<xenc:EncryptedKey Id="EK-94F51A72B114DE341F14741089873241" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>CN=server</ds:X509IssuerName>
								<ds:X509SerialNumber>1993907142</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>PS2pvtMCbzBH/aE9lbeD2wpuo8JXeO3aIljv+J49UdsVLZMYSQTHhj14kDhxlLV2OBUo9DuokJlw+Mc/nA/ygSGDahYXFpiQ/xEnDUSBhddw+g2rh6x5l2/KaLwcTBG8cEeYFQ4xlcBwJIOLaphQYixydxoouhD6Wzl01Ok0SAl7w/+inVaU+ne06EVnlZ19PSy8ecY9tjr8CKza1RUsUUJpZKPLOssRdiQh4X9JNBNqGcHER7HHnYfVPZtBBjynDAmtr0C0KCLliKMa/WEJrENqAPIzq3skT5P4Rtu0XiIEVRlCKMsSeu8DkTQvXnzLQ3hI5Y808OBcxHQIKEFj/Q==</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="#ED-94F51A72B114DE341F14741089873602"/>
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<xenc:EncryptedData Id="ED-94F51A72B114DE341F14741089873602" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
			<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
					<wsse:Reference URI="#EK-94F51A72B114DE341F14741089873241"/>
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>5QW40d2sVXbu9MwS4gKOOPiY7mj5VBroYaF6mYNYeNTAKTMVuyY+nzPlKT19fIzWO1tiK+2SLcEHZfhuIKZr5A==</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</soapenv:Body>
</soapenv:Envelope>